fca-rails-friends/app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "social", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "last_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "lastname"], ["updated_at", "2022-07-21 00:56:15.012977"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)